In [ ]:
pandas---> panel Data

1D-->Vector -->Series
2D-->Matrix -->Data Frame

In [9]:
import pandas as pd

In [10]:
#how to creat series

S1=pd.Series(data=[10,20,30,40],index=["Maths","English","Hindi","Science"])
print(s1)

Maths      10
English    20
Hindi      30
Science    40
dtype: int64

In [11]:
S2=pd.Series(data=[13,23,33,43],index=["Maths","English","Hindi","Science"])
print(s2)

Maths      13
English    23
Hindi      33
Science    43
dtype: int64

In [12]:
#Data Frame:
df_1=pd.DataFrame(data={"Eng_1":[10,20,30,40],"Hindi":[10,20,30,40]},index=["a","b","c","d"])
print(df_1)

   Eng_1  Hindi
a     10     10
b     20     20
c     30     30
d     40     40

In [13]:
pd.DataFrame(data={"col_1":S1,"col_2":S2})

         col_1  col_2
Maths       10     13
English     20     23
Hindi       30     33
Science     40     43

In [17]:
#importing the Data set into the notebook

df = pd.read_csv('C:/covid_19_data.csv')

In [18]:
print(df)

          Date     State          Region  Confirmed  Deaths  Recovered
0    4/29/2020       NaN     Afghanistan       1939      60        252
1    4/29/2020       NaN         Albania        766      30        455
2    4/29/2020       NaN         Algeria       3848     444       1702
3    4/29/2020       NaN         Andorra        743      42        423
4    4/29/2020       NaN          Angola         27       2          7
..         ...       ...             ...        ...     ...        ...
316  4/29/2020   Wyoming              US        545       7          0
317  4/29/2020  Xinjiang  Mainland China         76       3         73
318  4/29/2020     Yukon          Canada         11       0          0
319  4/29/2020    Yunnan  Mainland China        185       2        181
320  4/29/2020  Zhejiang  Mainland China       1268       1       1263

[321 rows x 6 columns]

# High Level Understanding Of Data:

In [19]:
df.head()

        Date State       Region  Confirmed  Deaths  Recovered
0  4/29/2020   NaN  Afghanistan       1939      60        252
1  4/29/2020   NaN      Albania        766      30        455
2  4/29/2020   NaN      Algeria       3848     444       1702
3  4/29/2020   NaN      Andorra        743      42        423
4  4/29/2020   NaN       Angola         27       2          7

In [20]:
df.tail()

          Date     State          Region  Confirmed  Deaths  Recovered
316  4/29/2020   Wyoming              US        545       7          0
317  4/29/2020  Xinjiang  Mainland China         76       3         73
318  4/29/2020     Yukon          Canada         11       0          0
319  4/29/2020    Yunnan  Mainland China        185       2        181
320  4/29/2020  Zhejiang  Mainland China       1268       1       1263

In [21]:
df.tail(10)

,Date,State,Region,Confirmed,Deaths,Recovered
311,4/29/2020,Virginia,US,14962,522,0
312,4/29/2020,Washington,US,14070,801,0
313,4/29/2020,West Virginia,US,1110,38,0
314,4/29/2020,Western Australia,Australia,551,8,507
315,4/29/2020,Wisconsin,US,6520,308,0
316,4/29/2020,Wyoming,US,545,7,0
317,4/29/2020,Xinjiang,Mainland China,76,3,73
318,4/29/2020,Yukon,Canada,11,0,0
319,4/29/2020,Yunnan,Mainland China,185,2,181
320,4/29/2020,Zhejiang,Mainland China,1268,1,1263

In [22]:
df.dtypes

Date         object
State        object
Region       object
Confirmed     int64
Deaths        int64
Recovered     int64
dtype: object

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 321 entries, 0 to 320
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       321 non-null    object
 1   State      140 non-null    object
 2   Region     321 non-null    object
 3   Confirmed  321 non-null    int64
 4   Deaths     321 non-null    int64
 5   Recovered  321 non-null    int64
dtypes: int64(3), object(3)
memory usage: 15.2+ KB

In [26]:
df.describe()

           Confirmed        Deaths      Recovered
count     321.000000    321.000000     321.000000
mean     9949.800623    709.152648    3030.277259
std     31923.853086   3236.162817   14364.870365
min         0.000000      0.000000       0.000000
25%       104.000000      2.000000       2.000000
50%       653.000000     12.000000      73.000000
75%      4655.000000    144.000000     587.000000
max    299691.000000  27682.000000  132929.000000

# Low Level Understanding of data:

In [28]:
df["Deaths"].describe()

count      321.000000
mean       709.152648
std       3236.162817
min          0.000000
25%          2.000000
50%         12.000000
75%        144.000000
max      27682.000000
Name: Deaths, dtype: float64

In [29]:
df.Recovered

0       252
1       455
2      1702
3       423
4         7
       ...
316       0
317      73
318       0
319     181
320    1263
Name: Recovered, Length: 321, dtype: int64